# Let's bring in pandas

In [86]:
import pandas as pd 
ufo = pd.read_csv('http://bit.ly/uforeports', sep=',')

In [87]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [88]:
ufo['State']

0        NY
1        NJ
2        CO
3        KS
4        NY
5        ND
6        CA
7        MI
8        AK
9        OR
10       CA
11       AL
12       SC
13       IA
14       MI
15       CA
16       CA
17       GA
18       TN
19       AK
20       NE
21       LA
22       LA
23       KY
24       WV
25       CA
26       WV
27       NM
28       NM
29       UT
         ..
18211    MA
18212    CA
18213    CA
18214    TX
18215    TX
18216    CA
18217    CO
18218    TX
18219    CA
18220    CA
18221    NH
18222    PA
18223    SC
18224    OK
18225    CA
18226    CA
18227    CA
18228    TX
18229    IL
18230    CA
18231    CA
18232    WI
18233    AK
18234    CA
18235    AZ
18236    IL
18237    IA
18238    WI
18239    WI
18240    FL
Name: State, Length: 18241, dtype: object

# Create column Location sep City + State

In [89]:
ufo['Location'] = ufo.City + ',' + ufo.State
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca,NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro,NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke,CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene,KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair,NY"

# Shape  number of row and column

In [90]:
ufo.shape

(18241, 6)

# look at data type

In [91]:
ufo.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
Location           object
dtype: object

# look at columns name

In [92]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time',
       'Location'],
      dtype='object')

# Remove Columns and Sort Some

axis: 0 or ‘index’ for rows and 1 or ‘columns’ for Column.
inplace: Boolean value. Makes the changes in passed data frame itself if True.
ascending: Boolean value which sorts Data frame in ascending order if True.
kind: String which can have three inputs(‘quicksort’, ‘mergesort’ or ‘heapsort’) of algorithm used to sort data frame.
na_position: Takes two string input ‘last’ or ‘first’ to set position of Null values. Default is ‘last’.

In [97]:
ufo.drop('Colors Reported', axis= 1, inplace= True)
ufo.head()

,City,Shape Reported,State,Time,Location
0,Ithaca,TRIANGLE,NY,6/1/1930 22:00,"Ithaca,NY"
1,Willingboro,OTHER,NJ,6/30/1930 20:00,"Willingboro,NJ"
2,Holyoke,OVAL,CO,2/15/1931 14:00,"Holyoke,CO"
3,Abilene,DISK,KS,6/1/1931 13:00,"Abilene,KS"
4,New York Worlds Fair,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair,NY"

#  Sort Values

In [103]:
ufo.State.sort_values(ascending=False).head(5)

12079    WY
11490    WY
11333    WY
4866     WY
3326     WY
Name: State, dtype: object

In [113]:
ufo.sort_values('State').head()

                City Shape Reported State             Time          Location
10454      Anchorage       CYLINDER    AK  6/30/1997 12:00      Anchorage,AK
14421         Seward          LIGHT    AK   9/2/1999 21:00         Seward,AK
3511   Kodiak Island         CIRCLE    AK   6/15/1977 2:00  Kodiak Island,AK
103        Anchorage           DISK    AK  6/10/1949 21:00      Anchorage,AK
2929          Nulato          LIGHT    AK  6/15/1975 18:30         Nulato,AK

# Sort two values

In [116]:
ufo.sort_values(['City' , 'State']).head()

            City Shape Reported State              Time      Location
1761   Abbeville           DISK    SC   12/10/1968 0:30  Abbeville,SC
2297    Aberdeen       TRIANGLE    MD    8/18/1972 1:30   Aberdeen,MD
9404    Aberdeen           DISK    MD   6/15/1996 13:30   Aberdeen,MD
16167   Aberdeen        VARIOUS    OH    3/29/2000 3:00   Aberdeen,OH
389     Aberdeen         CIRCLE    SD  11/15/1956 18:30   Aberdeen,SD